-- MySQL dump 10.13  Distrib 8.0.44, for Win64 (x86_64)
--
-- Host: 127.0.0.1    Database: welfaredb
-- ------------------------------------------------------
-- Server version	8.0.44

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `district`
--

DROP TABLE IF EXISTS `district`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `district` (
  `district_id` int NOT NULL AUTO_INCREMENT,
  `district_name` varchar(250) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `city_id` int DEFAULT NULL,
  PRIMARY KEY (`district_id`),
  KEY `city_id` (`city_id`),
  CONSTRAINT `district_ibfk_1` FOREIGN KEY (`city_id`) REFERENCES `city` (`city_id`)
) ENGINE=InnoDB AUTO_INCREMENT=235 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `district`
--

LOCK TABLES `district` WRITE;
/*!40000 ALTER TABLE `district` DISABLE KEYS */;
INSERT INTO `district` VALUES (2,'종로구',1),(3,'중구',1),(4,'용산구',1),(5,'성동구',1),(6,'광진구',1),(7,'동대문구',1),(8,'중랑구',1),(9,'성북구',1),(10,'강북구',1),(11,'도봉구',1),(12,'노원구',1),(13,'은평구',1),(14,'서대문구',1),(15,'마포구',1),(16,'양천구',1),(17,'강서구',1),(18,'구로구',1),(19,'금천구',1),(20,'영등포구',1),(21,'동작구',1),(22,'관악구',1),(23,'서초구',1),(24,'강남구',1),(25,'송파구',1),(26,'강동구',1),(27,'중구',2),(28,'서구',2),(29,'동구',2),(30,'영도구',2),(31,'부산진구',2),(32,'동래구',2),(33,'남구',2),(34,'북구',2),(35,'해운대구',2),(36,'사하구',2),(37,'금정구',2),(38,'강서구',2),(39,'연제구',2),(40,'수영구',2),(41,'사상구',2),(42,'기장군',2),(43,'중구',3),(44,'동구',3),(45,'미추홀구',3),(46,'연수구',3),(47,'남동구',3),(48,'부평구',3),(49,'계양구',3),(50,'서구',3),(52,'강화군',3),(53,'옹진군',3),(54,'중구',4),(55,'동구',4),(56,'서구',4),(57,'남구',4),(58,'북구',4),(59,'수성구',4),(60,'달서구',4),(61,'달성군',4),(62,'동구',5),(63,'중구',5),(64,'서구',5),(65,'유성구',5),(66,'대덕구',5),(67,'동구',6),(68,'서구',6),(69,'남구',6),(70,'북구',6),(71,'광산구',6),(72,'중구',7),(73,'남구',7),(74,'동구',7),(75,'북구',7),(76,'울주군',7),(77,'세종특별자치시',8),(78,'수원시',9),(79,'성남시',9),(80,'의정부시',9),(81,'안양시',9),(82,'부천시',9),(83,'광명시',9),(84,'평택시',9),(85,'동두천시',9),(86,'안산시',9),(87,'고양시',9),(88,'과천시',9),(89,'구리시',9),(90,'남양주시',9),(91,'오산시',9),(92,'시흥시',9),(93,'군포시',9),(94,'의왕시',9),(95,'하남시',9),(96,'용인시',9),(97,'파주시',9),(98,'이천시',9),(99,'안성시',9),(100,'김포시',9),(101,'화성시',9),(102,'광주시',9),(103,'여주시',9),(104,'양주시',9),(105,'포천시',9),(107,'연천군',9),(108,'가평군',9),(109,'양평군',9),(110,'춘천시',10),(111,'원주시',10),(112,'강릉시',10),(113,'동해시',10),(114,'태백시',10),(115,'속초시',10),(116,'삼척시',10),(117,'홍천군',10),(118,'횡성군',10),(119,'영월군',10),(120,'평창군',10),(121,'정선군',10),(122,'철원군',10),(123,'화천군',10),(124,'양구군',10),(125,'인제군',10),(126,'고성군',10),(127,'양양군',10),(128,'청주시',11),(129,'충주시',11),(130,'제천시',11),(131,'보은군',11),(132,'옥천군',11),(133,'영동군',11),(134,'증평군',11),(135,'진천군',11),(136,'괴산군',11),(137,'음성군',11),(138,'단양군',11),(139,'전주시',12),(140,'군산시',12),(141,'익산시',12),(142,'정읍시',12),(143,'남원시',12),(144,'김제시',12),(145,'완주군',12),(146,'진안군',12),(147,'무주군',12),(148,'장수군',12),(149,'임실군',12),(150,'순창군',12),(151,'고창군',12),(152,'부안군',12),(153,'포항시',13),(154,'경주시',13),(155,'김천시',13),(156,'안동시',13),(157,'구미시',13),(158,'영주시',13),(159,'영천시',13),(160,'상주시',13),(161,'문경시',13),(162,'경산시',13),(163,'의성군',13),(164,'청송군',13),(165,'영양군',13),(166,'영덕군',13),(167,'청도군',13),(168,'고령군',13),(169,'성주군',13),(170,'칠곡군',13),(172,'예천군',13),(173,'봉화군',13),(174,'울진군',13),(175,'울릉군',13),(176,'창원시',14),(177,'진주시',14),(178,'통영시',14),(179,'사천시',14),(180,'김해시',14),(181,'밀양시',14),(182,'거제시',14),(183,'양산시',14),(185,'의령군',14),(186,'함안군',14),(187,'창녕군',14),(188,'고성군',14),(189,'남해군',14),(190,'하동군',14),(191,'산청군',14),(192,'함양군',14),(193,'거창군',14),(194,'합천군',14),(195,'제주시',15),(196,'서귀포시',15),(197,'목포시',16),(198,'여수시',16),(199,'순천시',16),(200,'나주시',16),(201,'광양시',16),(203,'담양군',16),(204,'곡성군',16),(205,'구례군',16),(206,'고흥군',16),(207,'보성군',16),(208,'화순군',16),(209,'장흥군',16),(210,'강진군',16),(211,'해남군',16),(212,'영암군',16),(213,'무안군',16),(214,'함평군',16),(215,'영광군',16),(216,'장성군',16),(217,'완도군',16),(218,'진도군',16),(219,'신안군',16),(220,'천안시',17),(221,'공주시',17),(222,'보령시',17),(223,'아산시',17),(224,'서산시',17),(225,'논산시',17),(226,'계룡시',17),(227,'당진시',17),(228,'금산군',17),(229,'부여군',17),(230,'서천군',17),(231,'청양군',17),(232,'홍성군',17),(233,'예산군',17),(234,'태안군',17);
/*!40000 ALTER TABLE `district` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2025-11-23  3:37:20
